import { Component, OnInit } from '@angular/core';
import { LanguageService } from '../language.service';

@Component({
  selector: 'app-medic-train',
  templateUrl: './medic-train.component.html',
  styleUrls: ['./medic-train.component.scss']
})
export class MedicTrainComponent implements OnInit {

  para01 : string[] = [
    `“From more precised emergency trauma care then resuscitate to save lives.”`,
    `"ပိုမိုတိကျသော အရေးပေါ်အခြေအနေကုသပေးခြင်းဖြင့် အသက်များကယ်ဆွဲဆန့်နိုင်ရန်။" `
  ]

  para02mm : string[] = [
    `မိမိဘေးပါတ်ဝန်းကျင်ရှိ တစ်စုံတစ်ဦး ထိခိုက်ဒဏ်ရာရရှိင်လျှင် ရှေးဦးသူနာပြုစုအသက်ကယ်ရန်နှင့် ဘေးကင်းလုံခြုံစွာကယ်ထုတ်တတ်စေရန်။`,
    `ဒဏ်ရာရရှိသူ ၏ အခြေအနေပိုမိုမဆိုးရွားလာစေရန် နှင့် ကုသမှု(Definitive care) မရနိုင်သေးသည့်အချိန်တွင် အရေးပေါ်အခြေအနေကိုထိန်းထားနိုင်စေရန်။`,
    `ထိခိုက်ဒဏ်ရာရသူများကို ကျွမ်းကျင်စွာကယ်ထုတ်၍ နောက်တန်းရှိဆေးရုံများသို ချိတ်ဆက်ပိုဆောင်နိုင်ရန်။`,
    `မလိုလားအပ်သော အသက်အန္တရာယ်ဆုံးရှုးမှုများကို လျော့ချပေးနိုင်ရန်။`
  ];

  para02mu : string[] = [
    ``,
    ``,
    ``,
    ``
  ]

  para03mu : string[] = [
    ``,
    ``,
    ``,
    ``
  ];

  para03mm : string[] = [
    `ရှေ့တန်းထွက်မည့် ရဲဘော်တိုင်း စစ်မြေပြင်အသက်ကယ်နည်းများကို သိကျွမ်းထားရန်။`,
    `တပ်ရင်းတိုင်းတွင် ရှိသော ရဲဘော်ဦးရေနှင့်အညီ ၁၀:၁ နူန်းထားအတိုင်း ဆေးတပ်(Medic) များ ဖွဲစည်း၍ စစ်မြေပြင်တွင် သွေးထွက်လွန်ဒဏ်ရာများကို အရေးပေါ်ဆေးကုသမူ ပေးနိုင်ရန်။`,
    `ထ်ိခိုက်ဒဏ်ရာ အပြင်းအထန်ပေါ်မူတည်၍ ကျန်းမာရေးကွန်ယက်ကို ချိတ်ဆက်ပိုဆောင်နိုင်ရန်။`,
    `တပ်ရင်းအလိုက် သွေးအလှူရှင်အသင်း ဖွဲစည်းနိုင်ရန်။`
  ]

  para04: string[] = [
    ``,
    `လူနာကယ်ထုတ်စဉ်နှင့် သယ်ဆောင်ရာတွင် လမ်းကြောင်းများပိတ်ဆိုခြင်း၊ ကယ်ထုတ်ချိန်ကြာမြင့်ခြင်း၊ သွားလာရခက်ခဲခြင်းတိုကြောင့် အချိန်မှီဆေးကုသခွင့်မရခြင်း၊ သွေးထွက်လွန်ခြင်း၊ အသက်အန္တရာယ်ဆုံးရှုးခြင်းများကြုံတွေ့နိုင်သည်။ အရေးပေါ်သွေးတိတ်အောင်ပြုလုပ်ခြင်း၊ ရှေးဦးသူနာပြုစုခြင်းများကို တတ်ကျွမ်းထားပါကအသက်ပေါင်းများစွာကိုကယ်တင်နိုင်မည်ဖြစ်သည်။ လူတိုင်းသည် အရေးပေါ်အသက်ကယ်ပေးနိုင်သည့်သူများဖြစ်လာနိုင်ပါသည်။ ေးတပ်သားသင်တန်းတွင်  ပါတ်တီးစည်းခြင်း၊ အရေးပေါ်သွေးထိန်းခြင်းများနှင့် အကြောသွင်းအပ်ထည့်၍ သွေးထွက်များ၍ရှော့ရခြင်းကို အရည်ဓာတ်ဖြည့်သွင်းကုသခြင်း စသည့် အသေးစိတ်အချက်အလက်များထည့်သွင်းသင်ကြားဖြစ်ပါသည်။`
  ]

  imgcnt00 : string[] = [
    `Practising a case of eye injury & splintage of open fracture`,
    `မျက်လုံး ဒဏ်ရာနှင့် အရိုးအပွင့်ကျိုး ဒဏ်ရာတိုအား  လူနာအဖြစ် လေ့ကျင့်နေကြပုံ။`
  ]

  imgcnt01 : string[] = [
    `Bandaging an amputated patient with elastic bandage and usage of local made tourniquet`,
    `လက်ပြတ်လူနာအား သွေးထိန်းပတ်တီးစည်းခြင်းနှင့် ဆွဲသားပတ်တီးစည်းနည်းလေ့ကျင့်နေကြပုံ။`
  ]

  imgcnt02 : string[] = [
    `Practising of evacuation from battle field`,
    `တိုက်ပွဲဖြစ်ပွားရာနေရာမှကယ်ထုတ်ခြင်းနည်းလမ်းများကို လက်တွေ့လေ့ကျင့်နေကြပုံ။`
  ]

  imgcnt03 : string[] = [
    `Teaching of bleeding control and fluid therapy in emergency condition`,
    `အရေးသွေးထိန်းခြင်းနှင့် အရည်ဓါတ်ပြန်လည်ဖြည့်တင်းခြင်းဆိုင်ရာသင်ကြားနေစဉ်`
  ]

  constructor(private languageService : LanguageService) { }
  language : string = 'mu';
  ngOnInit(): void {
    this.languageService.subject.subscribe((lan) => {
      this.change_lan(lan);
    })
  }

  change_lan(lan : any) {
    this.language = lan;
  }

}
